Revit 2024 API
ElementId.IntegerValue Property
 Provides the value of the element id as a 32-bit integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the Value property instead.")]
public int IntegerValue { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the Value property instead.")> _
Public ReadOnly Property IntegerValue As Integer
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the Value property instead.")]
public:
property int IntegerValue {
	int get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the value of the element id is too large to be represented as a 32-bit integer.
See Also
ElementId Class
Autodesk.Revit.DB Namespace